dotfiles/.archive/System.org
#+title: System Configuration
# #+auto_tangle: t
#+startup: contents

* Table of Contents :TOC:
- [[#intro][Intro]]
- [[#personal-notes][personal notes]]
  - [[#things-to-set-up-in-here][Things to set up in here:]]
  - [[#for-the-future][For the future:]]
- [[#guix-system-configscm][Guix System config.scm]]
  - [[#main-unified-system-config][MAIN Unified System Config]]
  - [[#functionsscm][functions.scm]]
  - [[#system76-system-config][System76 System config]]
  - [[#thinkpad-system-config][Thinkpad System Config]]
  - [[#guix-system-reconfigure-script][Guix System reconfigure script]]
  - [[#oldobsolete-configs][old/obsolete configs]]
- [[#guix-channels][Guix Channels]]
  - [[#update-channels-script][Update channels script]]
  - [[#custom-guix-channel][Custom guix channel]]
- [[#guix-manifest-profiles][Guix manifest profiles]]
  - [[#activateupdate-profiles-script][Activate/update profiles script]]
- [[#user-services][User services]]
- [[#dotfiles-management][Dotfiles management]]
  - [[#pull-dotfiles][pull-dotfiles]]
  - [[#stow-dotfiles][stow dotfiles]]
  - [[#emacs-command-variants][emacs command variants]]
- [[#nix][Nix]]
- [[#guix-system-installation][Guix System installation]]
  - [[#initial][initial]]
  - [[#wifi][wifi]]
  - [[#partition-disks][partition disks]]
  - [[#create-filesystems-and-mount][create filesystems and mount]]
  - [[#partial-installation-script][Partial installation script]]

* Intro

Half of this is copied from daviwil.

* personal notes

** Things to set up in here:

- manifests for all (at the top, before guix channels?)
- read through the docs (save the docs (maybe in emacs?)) (very fun :3)
- fill in dotfiles management headline
  - script to save all org docs and save to stash before git pull, then pop from stash, in order to avoid merge conflicts and fucc ups. (how to make running this command more streamlined? make an alias emacs function that runs the shellscript? integrate into magit if shellscript available?)
  - right after git pull and resolve merge conflicts, org-tangle all and then stow . (so that i can maintain changes from all computers (unnecessary? overkill? only the org tangle part? is the org tangle part even necessary? well, i guess if im gonna be quitting emacs soon, then id want my other stuff to tangle... and i'll forget to stow . bc i'll never do it otherwise...))

** For the future:

- Consider changing the manifest and profile system into something where running a script generates a new manifest file with everything, and just one profile is created from it.
  - Although one nice thing about this current system is updating only desktop packages and not everything to prevent pulling and compiling bigger packages...

NixOS is actually viable.....
- only free software option,
- beautiful hyfetch,
- nice lang,
- cute trans girls use it,
- makes me feel good and euphoric (better than the peace of guix and lisp??)

* Guix System config.scm

Useful dotfiles:
[[https://github.com/jsoo1/dotfiles/blob/release/guix/config.scm][jsoo1 guix config.scm dotfiles]]

Notes:
- pipewire:
  [[https://lists.gnu.org/archive/html/help-guix/2022-02/msg00198.html][gnu lists - pipewire discussions]]
  i can probably just manually start up pipewire.
  Pipewire startup script in here:
  https://codeberg.org/SystemCrafters/crafted-guix
- firejail:
  [[https://nixos.wiki/wiki/Firejail][nixos wiki - firejail]]
  if only firejail on global guix profile, can i still use nix shell? regular nix install, plus guix firejail works??

Troubleshooting:
- Swap doesn't exactly work... Using =swap-space= in operating system results in an error, so i wrap it in =swap-devices=, so that it works. =herd services status= says ,,, lsblk says ,,, running swapon makes it work, but herd still shows servcie not runnig.

** MAIN Unified System Config

*** modules

#+begin_src scheme :tangle .config/guix/systems/main.scm

  (define-module (main)
    #:use-module (gnu)
    #:use-module (gnu system) ; sudoers
    #:use-module (nongnu packages linux) ; import kernel
    #:use-module (nongnu packages video) ; intel-graphics
    #:use-module (nongnu system linux-initrd) ; import firmware
    #:use-module (gnu system setuid) ; setuid
    #:use-module (gnu services desktop)
    #:use-module (gnu services networking)
    #:use-module (gnu services xorg)
    #:use-module (gnu services pm) ; power management
    #:use-module (gnu services sysctl) ; wm.swappiness
    #:use-module (gnu services sound)
    #:use-module (gnu services audio)
    #:use-module (gnu services nix)
    #:use-module (gnu services shepherd)
    #:use-module (gnu services docker)
    #:use-module (gnu services linux) ; kernel-module-loader
    #:use-module (gnu services databases) ; mysql experiments
    #:use-module (gnu packages wm)
    #:use-module (gnu packages fonts)
    #:use-module (gnu packages certs)
    #:use-module (gnu packages shells)
    #:use-module (gnu packages linux) ; access packages (setuid)
    #:use-module (gnu packages suckless) ; slock
    #:use-module (gnu packages xdisorg) ; xscreensaver
    )


#+end_src

*** packages

#+begin_src scheme :tangle .config/guix/systems/main.scm

  ;; to add to this, do: (append (list (<new stuff>)) my-default-packages)
  (define %my-default-packages
    (append
     (map specification->package+output
          '("vim"
            ;; essentials
            "git" "stow"
            ;; emacs packages
            "emacs" "emacs-exwm"
            ;; necessary?
            "emacs-desktop-environment"
            ;; firejail setuid
            "firejail" "xdg-dbus-proxy"
            ;; wireguard-tools
            "wireguard-tools"
            ;; slock
            "slock" "xss-lock"
            ;; stumpwm
            "sbcl" "stumpwm-with-slynk" ; "stumpwm:lib" "sbcl-stumpwm-ttf-fonts" "font-dejavu"
            ;; mount android phone
            "jmtpfs"
            ;; graphics drivers
            "intel-media-driver-nonfree"
            ;; wayland 
            "cage"
            ;; https access
            "nss-certs"))
     %base-packages))

#+end_src

*** setuid-programs

#+begin_src scheme :tangle .config/guix/systems/main.scm

  ;; simply place my-setuid-programs in config
  (define %my-setuid-programs
    ;; add firejail and slock to setuid
    (append (list (setuid-program (program (file-append firejail "/bin/firejail")))
                  (setuid-program (program (file-append xscreensaver "/bin/xscreensaver"))))
            %setuid-programs))

#+end_src

*** services - special and helper vars

**** iwlwifi

#+begin_src scheme :tangle .config/guix/systems/main.scm
  
  ;; Fixes wifi issues with AX200:
  ;; Below has the same effect as running 'iw wlan0 set power_save off'.
  ;; Both option sets are needed as iwlmvm will override iwlwifi.
  ;; For iwlmvm: 1=always on, 2=balanced, 3=low-power.
  (define iwlwifi-config
    (plain-file "iwlwifi.conf"
                "options iwlwifi power_save=0
                    options iwlmvm power_scheme=1"))  

  (define %iwlwifi-fix-services
    (list
     ;; fix unstable wifi
     (service kernel-module-loader-service-type
              '("iwlwifi"))
     (simple-service 'iwlwifi-config etc-service-type
                     (list `("modprobe.d/iwlwifi.conf"
                             ,iwlwifi-config)))))

#+end_src

**** fstrim

#+begin_src scheme :tangle .config/guix/systems/main.scm

  ;; weekly SSD-trim
  (define %fstrim-service
    (list
     (service fstrim-service-type
              (fstrim-configuration
               (schedule "0 17 * * 5"))))) ; 5pm, Fri

#+end_src

**** pam-limits

#+begin_src scheme :tangle .config/guix/systems/main.scm

  ;; fixes issues on music DAWs
  (define %pam-limits-service
    (list
     (service pam-limits-service-type
              (list
               (pam-limits-entry "@realtime" 'both 'rtprio 99)
               (pam-limits-entry "@realtime" 'both 'memlock 'unlimited)))))

#+end_src

**** xorg-libinput-config

#+begin_src scheme :tangle .config/guix/systems/main.scm

  (define %xorg-libinput-config
    "Section \"InputClass\"
    Identifier \"Touchpads\"
    Driver \"libinput\"
    MatchDevicePath \"/dev/input/event*\"
    MatchIsTouchpad \"on\"

    Option \"Tapping\" \"on\"
    Option \"TappingDrag\" \"on\"
    Option \"DisableWhileTyping\" \"on\"
    Option \"MiddleEmulation\" \"on\"
    Option \"ScrollMethod\" \"twofinger\"
  EndSection
  Section \"InputClass\"
    Identifier \"Keyboards\"
    Driver \"libinput\"
    MatchDevicePath \"/dev/input/event*\"
    MatchIsKeyboard \"on\"
  EndSection
  ")

#+end_src

**** nongnu substitute server key

#+begin_src scheme :tangle .config/guix/systems/main.scm
  
  (define nonguix-substitute-server-key
    (plain-file
     "non-guix.pub"
     "(public-key (ecc (curve Ed25519) (q #C1FD53E5D4CE971933EC50C9F307AE2171A2D3B52C804642A7A35F84F3A4EA98#)))"
     )
    )

#+end_src

*** services

#+begin_src scheme :tangle .config/guix/systems/main.scm

  (define %my-services-a
    (cons*
     ;; for mostly system level power events
     (service elogind-service-type)
     ;; might be unnecessary... but might as well keep it
     (service wpa-supplicant-service-type)
     ;; network manager
     (service network-manager-service-type)
     ;; power management
     (service tlp-service-type
              (tlp-configuration
               ;; for renoise/music DAW
               (cpu-scaling-governor-on-ac (list "performance"))
               (cpu-scaling-governor-on-bat (list "performance"))
               (energy-perf-policy-on-ac "performance")
               (energy-perf-policy-on-bat "performance")))
     ;; pulseaudio (must install pulseaudio package separately (maybe install system-wide?))
     ;; (configure through pulseaudio-configuration list rather than ~/.config/pulse)
     ;; choose user-side config instead
     ;; (service pulseaudio-service-type)
     ;; mpd basic setup
     (service mpd-service-type) ; doesn't work, didnt pull depend?
     ;; cpu frequency scaling
     (service thermald-service-type
              (thermald-configuration
               (adaptive? #t)))
     ;; nix service type
     (service nix-service-type)
     ;; auto mount usb devices
     (service udisks-service-type)
     ;; docker service
     (service docker-service-type)

     ;; delete this later after checking if /etc/security/limimts.conf appears!!!!!!!!
     (service pam-limits-service-type
              (list
               (pam-limits-entry "@realtime" 'both 'rtprio 99)
               (pam-limits-entry "@realtime" 'both 'memlock 'unlimited)))

     ;; screen lock
     (service screen-locker-service-type
              (screen-locker-configuration
               (name "slock")
               (program (file-append slock "/bin/slock"))
               (using-pam? #t)
               (using-setuid? #t)))
     ;; mullvad-vpn
     ;; (serivce mullvad-daemon-service-type)
     ;; (service mullvad-daemon-shepherd)
     ;; (simple-service 'my-mullvad-daemon 
     ;;            #~(job '(next-hour (3)) "guix gc -F 2G"))
     ;; bluetooth for filesharing
     (service bluetooth-service-type
              (bluetooth-configuration
               (privacy 'network/on)))
     ;; mysql for testing
     (service mysql-service-type)
     ;; modify %base-services
     (modify-services
      %base-services
      (sysctl-service-type
       config => (sysctl-configuration
                  (settings (append '(("vm.swappiness" . "1"))
                                    %default-sysctl-settings))))
      (guix-service-type
       config => (guix-configuration
                  (inherit config)
                  (substitute-urls
                   (append (list "https://substitutes.nonguix.org")
                           %default-substitute-urls))
                  (authorized-keys
                   (append (list nonguix-substitute-server-key)
                           %default-authorized-guix-keys)))))))

  (define %my-services
    (append %my-services-a
            ;; fixes iwlwifi
            %iwlwifi-fix-services
            ;; weekly SSD-trim
            %fstrim-service
            ;; for music DAWs
            %pam-limits-service))

#+end_src

*** users

#+begin_src scheme :tangle .config/guix/systems/main.scm

  (define %my-users
    (cons* (user-account
            (name "yui")
            (comment "Yui")
            (group "users")
            (home-directory "/home/yui")
            (supplementary-groups '("wheel" ;; sudo
                                    "audio" "video"
                                    "netdev" ;; network devices
                                    "kvm" "docker"
                                    "realtime" ; music
                                    )))
           %base-user-accounts))

#+end_src

*** groups

#+begin_src scheme :tangle .config/guix/systems/main.scm

  (define %my-groups
    (cons (user-group (system? #t) (name "realtime"))
          %base-groups))

#+end_src

