dotfiles/.archive/System.org
** emacs command variants

#+begin_src emacs-lisp :tangle .emacs.d/lisp/ri-git-interface-commands.el

  (defun ri/git-pull-dotfiles ()
    "Run the pull-dotfiles shell command, which stashes existing changes, runs `git pull origin master', pop the stash, then `stow .' to update."
    (interactive)
    (let ((dot-root (f-parent user-emacs-directory)))
      (if (f-directory-p (concat dot-root "/.git"))
          (shell-command (concat "sh " dot-root "/.bin/pull-dotfiles"))
        (error "The root dotfiles directory is not a parent directory of `.emacs.d', so it cannot locate the `.bin' directory, where `pull-dotfiles' command exists. Maybe try to come up with a better solution, so that the user-emacs-directory doesn't have to be in the root dotfiles directory? Maybe in the form of an environmental variable at startup?"))))

  (defun ri/stow-dotfiles ()
    "Run the stow command on the root dotfiles directory."
    (interactive)
    (let ((dot-root (f-parent user-emacs-directory)))
      (if (f-file-p (concat dot-root "/.stow-local-ignore"))
          (shell-command (concat "sh " dot-root "/.bin/stow-dotfiles"))
        (error "The root dotfiles directory is not a parent directory of `.emacs.d', so it cannot locate the `.bin' directory, where `pull-dotfiles' command exists. Maybe try to come up with a better solution, so that the user-emacs-directory doesn't have to be in the root dotfiles directory? Maybe in the form of an environmental variable at startup?"))))

  (provide 'ri-git-interface-commands)

#+end_src

* Nix

* Guix System installation

When installing Guix System, follow both instructions side by side:
[[https://guix.gnu.org/manual/en/html_node/Keyboard-Layout-and-Networking-and-Partitioning.html][Guix System installation guide]]
[[https://wiki.systemcrafters.net/guix/nonguix-installation-guide/][System Crafters - Guix System Installation Guide]]
[[https://wiki.archlinux.org/title/Partitioning#Example_layouts][Arch Wiki - Partition layouts examples]]
https://guix.gnu.org/manual/en/guix.html#Manual-Installation

(for EFI, btrfs)

** initial

- keyboard layout

  : loadkeys dvorak

** wifi

*** if wifi card blocked, unblock

: rfkill unblock all

*** if wired connection

: ip link set <interface> up

*** if wifi

: vim wpa_supplicant.conf

#+begin_src conf :tangle no
network={
  ssid="my-ssid"
  key_mgmt=WPA-PSK
  psk="the network's secret passphrase"
}
#+end_src

: wpa_supplicant -c wpa_supplicant.conf -i <interface> -B
: dhclient -v interface
: ping -c 3 gnu.org  # might not work, when wifi actually works

** partition disks

: fdisk <partition>
(sda1(EFI,+1G), sda2(Linux,Rest))
(keys:
  p(print)
  g(new gpt disklabel)
  n(new part)
    (part #)
    (first sector (def))
    (last sector (size (Ex: +1G, +512M)))
  t(part type)
    L(list all)
    (type # (EFI=1, LinuxFilesystem=(Linux,20), LinuxRoot(x86-64)=(23;better?)))
)

- EFI partition
  (+1G, type1)
- Root partition
  (Enter, typeLinux)

** create filesystems and mount

*** for efi partition:

: mkfs.fat -n "MY-BOOT" -F32 /dev/nvme0n1p1

*** if not using luks for root partition:

: mkfs.btrfs -L my-root /dev/nvme0n1p2
: mount LABEL=my-root /mnt

: mount /dev/<EFI partition> /mnt/boot/efi

*** if using luks for root partition:

based on:
- [[https://github.com/abcdw/rde/blob/9e31470ba79d6b2e8e908256702616a1902b7aa3/rde/scripts/install.sh][rde install cheat sheet]]
- [[https://github.com/abcdw/rde/blob/9e31470ba79d6b2e8e908256702616a1902b7aa3/rde/system/desktop.scm][rde install system config]]
- [[https://www.codyhou.com/arch-encrypt-swap/][arch encrypted btrfs swap snapper]]
- [[https://manueljimenezs.github.io/2020/05/full-disk-encryption-on-archlinux-with-lvm-luks-btrfs/][arch lvm luks btrfs]]
- [[https://nixos.wiki/wiki/Btrfs][nixos wiki btrfs encrypted]]
- [[https://sawyershepherd.org/post/hibernating-to-an-encrypted-swapfile-on-btrfs-with-nixos/][nixos btrfs swapfile hibernation guide]]
- [[https://www.reddit.com/r/GUIX/comments/suylu8/encrypted_swap_on_guix/][reddit encrypted swap in system config]]
- [[https://guix.gnu.org/en/manual/devel/en/html_node/Swap-Space.html][guix docs swapfile hibernation examples]]

(dont use pbkdf2? breaks it? try running ~cryptsetup luksDump <device>~ and look for PBKDF?)

: cryptsetup luksFormat --type luks1 /dev/nvme0n1p2 
: cryptsetup open /dev/nvme0n1p2 enc
: mkfs.btrfs -L my-root /dev/mapper/enc
: mount -t btrfs /dev/mapper/enc /mnt

# mounted on cryptroot, create subvolumes
: btrfs subvolume create /mnt/root
: btrfs subvolume create /mnt/boot
: btrfs subvolume create /mnt/home
: btrfs subvolume create /mnt/gnu
: btrfs subvolume create /mnt/data
: btrfs subvolume create /mnt/log
: btrfs subvolume create /mnt/snapshots  # new
: btrfs subvolume create /mnt/swap  # new

# empty snapshot of the root subvolume, which can be rollback to on every boot
: btrfs subvolume snapshot -r /mnt/root /mnt/root-blank

# unmount cryptroot
: umount /mnt

# remount subvolumes and boot partition

# TODO: ask discord if all these options for subvolumes is bad

: mount -o noatime,compress=zstd,space_cache=v2,subvol=root /dev/mapper/enc /mnt
# rewrite, broken in eshell
: cd /mnt
: mkdir -p home gnu data var/log .snapshots swap boot
: mount -o noatime,compress=zstd,space_cache=v2,subvol=home /dev/mapper/enc home
: mount -o noatime,compress=zstd,space_cache=v2,subvol=gnu /dev/mapper/enc gnu
: mount -o noatime,compress=zstd,space_cache=v2,subvol=data /dev/mapper/enc data
: mount -o noatime,compress=zstd,space_cache=v2,subvol=log /dev/mapper/enc var/log
: mount -o noatime,compress=zstd,space_cache=v2,subvol=snapshots /dev/mapper/enc .snapshots
: mount -o noatime,subvol=swap /dev/mapper/enc swap
: mount -o noatime,compress=zstd,space_cache=v2,subvol=boot /dev/mapper/enc boot
: cd -

: blkid  # to get uuid of EFI_PARTITION
: mkdir -p /mnt/boot/efi
: mount EFI_PARTITION /mnt/boot/efi

*** Swapfile (btrfs, assuming swapfile at /mnt/swap/swapfile)

**** Method 1: doesn't work?!?!

: cd /mnt/swap
: chattr +C /mnt/swap
: fallocate -l 16G /mnt/swap/swapfile
: chmod 0600 ./swapfile
: mkswap -U clear ./swapfile

**** Method 2: works?!?!

: btrfs filesystem mkswapfile --size 16g --uuid clear /mnt/swap/swapfile

**** swapon

# : swapon ./swapfile
    
*** Start copy-on-write store

# Copy /gnu/store on write:
: herd start cow-store /mnt

*** Download guix dots for base-channels.scm and system config 

# clone from either personal, or daviwil's (https://codeberg.org/daviwil/dotfiles)
: git clone <url to my repo with guix channels>

: mkdir -p ~/.config/guix
: cp ~/dotfiles1/.config/guix/base-channels.scm ~/.config/guix/channels.scm

*** Pull from non-free repo (and regular) and add nonguix substitute server

: guix pull --channels="$HOME/.config/guix/channels.scm"
: GUIX_PROFILE=/root/.config/guix/current
: . $GUIX_PROFILE/etc/profile
: hash guix
# get signing key and authorize
: curl https://substitutes.nonguix.org/signing-key.pub -o signing-key.pub
: guix archive --authorize < signing-key.pub

*** Configure system config

: mkdir /mnt/etc
: cp ~/yui-dotfiles/guix/src/systems/nyanko.scm /mnt/etc/

# set luksUUID (cryptsetup luksUUID /dev/nvme0n1p2) and efi partition uuid (lsblk -f)
# set resume_offset kernel parameter (filefrag -e /mnt/swap/swapfile)

*** Install system

# make sure everything is set up!

: guix system init /mnt/etc/nyanko.scm /mnt --substitute-urls="https://ci.guix.gnu.org https://bordeaux.guix.gnu.org https://substitutes.nonguix.org"

*** Misc (probably not necessary)

Check and make sure grub isn't broken by running:
: guix system reconfigure /mnt/etc/config.scm
doesnt work...

works:
: /gnu/store/uhjagcmkabdgkanhaajnthak-grub-2.06/sbin/grub-install --no-floppy --target=i386-pc --boot-directory /mnt/boot /dev/nvme0n1p1
(probably fucks things up even more)

*** Post-installation checks

- decryption, number of password entries (when resuming from hibernation?)
- hibernation, swapfile
-

*** Modifications

https://linux-blog.anracom.com/2018/11/30/full-encryption-with-luks-sha512-aes-xts-plain64-grub2-really-slow/

*** Repair process

**** Grub rescue

https://guix.gnu.org/manual/devel/en/html_node/Chrooting-into-an-existing-system.html

(at boot:
 insmod luks
 cryptmount hd0,
 )

 
**** Chrooting

: loadkeys dvorak

: rfkill unblock all

: vim wpa_supplicant.conf

: wpa_supplicant -c wpa_supplicant.conf -i wlan0 -B
: dhclient -v wlan0

: cryptsetup open /dev/nvme0n1p2 enc
: mount -o subvol=root /dev/mapper/enc /mnt
: mount -o subvol=home /dev/mapper/enc /mnt/home
: mount -o subvol=gnu /dev/mapper/enc /mnt/gnu
: mount -o subvol=data /dev/mapper/enc /mnt/data
: mount -o subvol=log /dev/mapper/enc /mnt/var/log
: mount -o subvol=snapshots /dev/mapper/enc /mnt/.snapshots
: mount -o subvol=swap /dev/mapper/enc /mnt/swap
: mount -o subvol=boot /dev/mapper/enc /mnt/boot

: mount -L MY-BOOT /mnt/boot/efi

: mount --rbind /proc /mnt/proc
: mount --rbind /sys /mnt/sys
: mount --rbind /dev /mnt/dev

: chroot /mnt /gnu/store/...bash.../bin/sh

: source /var/guix/profiles/system/profile/etc/profile
: source /home/nya/.guix-profile/etc/profile

: guix-daemon --build-users-group=guixbuild --disable-chroot &


: # git clone https://<dotfiles1 repo>
: cp ~/dotfiles1/.config/guix/base-channels.scm ~/channels.scm
: guix pull --channels="$HOME/channels.scm"
: # source GUIX_PROFILE

: 

** Partial installation script

#+begin_src shell :tangle .bin/initial-install-guix.sh :shebang #!/bin/sh

  # This file is edited in System.org

  ## After wifi, loadkeys, and partitioning, git clone and run the script!

  ROOT="nvme0n1p2"
  SWAP="sda1"

  main() {
      while
          LOOP=0
          echo "_____________________________________________________________________"
          echo ""
          echo "Did you partition your drives first? Is 'dotfiles1' in the home dir?"
          echo "mkfs.btrfs and mkswap must be done first if not already done so."
          echo ""
          echo "Options:"
          echo "0.) ALREADY CREATED RECOVERY mount (cryptroot, $ROOT), swapon ($SWAP)."
          echo "1.) herd start cow-store."
          echo "2.) nonguix channel, guix pull, prompt to run GUIX_PROFILE."
          echo "3.) install neovim (and other essentials), then prompt to run GUIX_PROFILE."
          echo "4.) copy config.scm to /etc/guix, then get and add signing key."
          echo "5.) edit config.scm with nvim."
          echo "6.) proceed with system install (regular) (prompts text if not working)."
          echo "7.) change default root ($ROOT) and swap ($SWAP) partitions."
          echo ""
          echo -n "> "
          read in
          case $in in
              0)
                  cryptsetup open /dev/$ROOT my-partition
                  mount LABEL=my-root /mnt
                  # swapon /dev/$SWAP
                  ;;
              1)
                  herd start cow-store /mnt
                  ;;
              2)
                  mkdir -p ~/.config/guix
                  cp ~/dotfiles1/.config/guix/base-channels.scm ~/.config/guix/channels.scm
                  guix pull --channels="$HOME/.config/guix/base-channels.scm"
                  echo -e "\n> Run the following manually, by hand:"
                  echo "GUIX_PROFILE=\"/root/.config/guix/current\""
                  echo ". \"$GUIX_PROFILE/etc/profile\""
                  echo "hash guix"
                  ;;
              3)
                  guix install neovim
                  echo -e "\n> Run the following manually, by hand:"
                  echo "GUIX_PROFILE=\"/root/.guix-profile\""
                  echo ". \"$GUIX_PROFILE/etc/profile\""
                  echo "hash guix"
                  ;;
              4)
                  cp ~/dotfiles1/.config/guix/gnuwu.scm /etc/guix/
                  curl https://substitutes.nonguix.org/signing-key.pub -o signing-key.pub
                  guix archive --authorize < signing-key.pub
                  ;;
              5)
                  nvim /etc/guix/gnuwu.scm
                  ;;
              6)
                  guix system init /etc/guix/gnuwu.scm /mnt --substitute-urls="https://ci.guix.gnu.org https://bordeaux.guix.gnu.org https://substitutes.nonguix.org"
                  ;;
              7)
                  echo -en "Enter new value for ROOT partition '/dev/VALUE' (old: '$ROOT'):\n> "
                  read in
                  ROOT="$in"
                  echo -en "Enter new value for SWAP partition '/dev/VALUE' (old: '$SWAP'):\n> "
                  read in
                  SWAP="$in"
                  clear
                  # loop one more time
                  LOOP=1
                  ;;
              ,*)
                  echo "Failed to find match, exiting..."
                  ;;
          esac

          (( $LOOP == 1 ))
      do true; done
  }

  main

#+end_src
